Tekla.Structures.ModelInternal.Ifc2x3ExportCreator
The IFC export creator class responsible for creating IFC 2x3 export.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.model
The model.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.pluginDataPropertyCount
Gets the known plugin data property count.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.propertyNameToFieldNameMap
The mapping between property names and field names used by IFC export.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.ExportWithSettings(System.String,Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.SelectionTypes,Tekla.Structures.Model.Operations.Operation.IFC2x3ExportViewTypeEnum,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.Boolean,System.Boolean,System.Boolean,System.String,System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.String})
Exports the selected model objects to IFC2x3 format using the specified export settings.
outputFileName: The output file name and path.
selectionType: The export selection type.
exportViewType: The export view type (e.g., coordination view, steel fabrication view).
includeAssemblyHierarchy: If true, assembly hierarchy (IFCELEMENTASSEMBLY) is included in export.
exportReinforcingBars: If true, reinforcing bars are included in the export.
exportBolts: If true, bolts are included in the export.
exportGrids: If true, grids are included in the export.
exportPourObjects: If true, pour objects are included in the export.
exportWelds: If true, welds are included in the export.
exportSurfaceTreatments: If true, surface treatments are included in the export.
exportSpaces: If true, spaces are included in the export.
exportLayersNameAsPart: If true, layer names are exported as part names.
excludeSinglePartAssemblies: If true, single part assemblies are excluded from the export.
locationsFromOrganizer: If true, locations are determined from the organizer.
nameOfBasePoint: The name of the base point to use for export coordinates.
locationByValue: The location by value.
exportFlatBeamsAsPlates: If true, flat beams are exported as plates.
useViewColors: If true, view colors are used in the export.
polyBeamAsSectionedSpine: If true, polybeams are exported as sectioned spines.
additionalPropertySetFileName: The name of the additional property set file to use.
exportBuildingHierarchy: If true, building hierarchy is included in the export.
exportBrepAsExactSolid: If true, BREP geometry is exported as exact solids.
attributesOverridesFileNames: The collection of full paths and file names of the attributes overrides files (*_overrideSetData.attributeoverride and *_overrideData.attributeoverride) to use in export. Empty for none.
Returns: The full path to the exported IFC file, or null if the export failed.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.GetExportPluginDataSettings(Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.SelectionTypes,System.Boolean,System.Boolean,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.String,System.String,System.String)
Gets the export plugin data settings based on the provided parameters.
selectionType: The type of selection for the export process.
includeAssemblyHierarchy: If true, assembly hierarchy (IFCELEMENTASSEMBLY) is included in export.
exportReinforcingBars: Indicates whether reinforcing bars should be exported.
exportBolts: Indicates whether bolts should be exported.
selectedExportType: The selected type of export.
exportFormat: The format in which the data should be exported.
exportGrids: Indicates whether grids should be exported.
exportPourObjects: Indicates whether pour objects should be exported.
exportWelds: Indicates whether welds should be exported.
exportLayersNameAsPart: Indicates whether layer names should be exported as part names.
exportSurfaceTreatments: Indicates whether surface treatments should be exported.
excludeSinglePartAssemblies: Indicates whether single part assemblies should be excluded from export.
locationsFromOrganizer: Indicates whether locations should be derived from the organizer.
nameOfBasePoint: The name of the base point for the export.
locationByIndex: The index used for location determination.
exportFlatBeamsAsPlates: Indicates whether flat beams should be exported as plates.
useViewColors: Indicates whether view colors should be used in the export.
polyBeamAsSectionedSpine: Indicates whether poly beams should be exported as sectioned spines.
additionalPropertySetFileName: The file name for additional property sets.
exportBuildingHierarchy: Indicates whether the building hierarchy should be exported.
exportBrepAsExactSolid: Indicates whether BREP should be exported as exact solids.
exportSpaces: Indicates whether spaces should be exported.
exportAttributeOverrideSetDataFile: The file name for attribute override set data.
exportAttributeOverrideDataFile: The file name for attribute override data.
filterName: The filter name. If provided, then export by selection filter instead of selectionType.
Returns: The plugin data settings.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.CreateComponent(IFCExportPlugin.Contracts.IPluginData)
Creates the IFC export component based on the provided settings.
settings: The settings.
Returns: The created component.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.GetAvailablePluginDataProperties
Gets the available plugin data properties.
Returns: The plugin data properties.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.GetExportFormat(System.String)
Gets the export format from the output file name.
outputFileName: The output file name.
Returns: The export format as an integer index.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.GetLocationByIndex(Tekla.Structures.Model.Operations.Operation.ExportBasePoint)
Gets the location by index based on the provided export base point value.
locationByValue: The location by value.
Returns: The location by index.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.GetSelectedExportType(Tekla.Structures.Model.Operations.Operation.IFC2x3ExportViewTypeEnum)
Gets the export type index based on the provided export view type.
exportViewType: The export view type.
Returns: The export type index.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.GetExportAttributeOverrideSetDataFile(System.Collections.Generic.IEnumerable{System.String})
Gets the override set data file name from the provided attributes overrides file names.
attributesOverridesFileNames: The attributes overrides file names.
Returns: The override set data file name, or an empty string if not found.

Tekla.Structures.ModelInternal.Ifc2x3ExportCreator.GetExportAttributeOverrideDataFile(System.Collections.Generic.IEnumerable{System.String})
Gets the override data file name from the provided attributes overrides file names.
attributesOverridesFileNames: The attributes overrides file names.
Returns: The override data file name, or an empty string if not found.